Revit 2027 API
Space.DesignHVACLoadperArea Property
Get or set the Design HVAC Load per Area of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DesignHVACLoadperArea { get; set; }
Public Property DesignHVACLoadperArea As Double
	Get
	Set
public:
property double DesignHVACLoadperArea {
	double get ();
	void set (double value);
}
member DesignHVACLoadperArea : float with get, set
Property Value
Double
Remarks
This property is used to get or set the Design HVAC Load per Area (Unit: W/ft2) of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace